{"pageProps":{"posts":[{"content":"\n### Reference\n\n- ThumbnailSrc: Photo by [Markus Spiske](https://unsplash.com/@markusspiske?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText) on [Unsplash](https://unsplash.com/s/photos/internet?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText)\n\n인터넷이 처음 세상에 등장한 이래로 다양한 종류의 네트워크 구조가 만들어졌다. 작게는 우리가 사용하는 Wifi를 구성하는 LAN 영역에서 부터 전체 세상을 연결하는 Internet와 같은 광범위한 네트워크가 존재한다.\n\n해당 Posting에서는 일반적인 LAN을 제외한 Network의 대표적인 종류를 알아보고 특징을 정리할 것이다.\n\n## BackBorn Network\n\nBackBorn은 등뼈, 중추를 의미한다. 즉, 네트워크의 중추라는 것이다. 해당 네트워크는 각 Node와 Node를 직접적으로 연결하기 보다는 이미 구성되어있는 LAN 간의 연결을 수행하는 네트워크이다. 작은 범위에서는 특정 건물 내에서의 LAN간을 연결하는 Network를 의미하기도 하지만 대게의 경우 LAN과 Internet을 연결하는 Internet BackBorn Network를 의미한다.\n\n우리가 Ethernet을 통해서 공유기에 packet을 전달하면, 공유기는 건물 내 Switch로 연결되고, 이것이 BackBorn Network로 packet을 보내면 BackBorn에서 이를 올바른 Network로 다시 옮기는 역할을 수행한다.\n\n대게 이와 같은 일은 통신사업자(국내에는 KT, SKT, LG)가 수행하고 있다. 물론 접속하고자 하는 사이트가 해외에 위치하는 경우 해외 통신사업자의 BackBorn으로 넘어가서 해당 Network를 찾게 되는 것이다. 따라서, 이를 그림으로 나타내면 아래와 같다.\n\n![backborn network](/images/backborn-network.jpeg)\n\n### Topology\n\n이러한 BackBorn Network를 구성할 때에 주로 사용되는 것은 Star topology이다. 이는 Star topology는 하나 이상의 중심 node로 traffic이 몰리게 되는데 이러한 구조는 관리 및 요금 측정 등과 같은 과정을 쉽게 처리하는 것이 가능하기 때문이다. 하지만, 중심으로 traffic이 집중되는 만큼 재난 발생에 취약할 수 있고, 이로 인한 지연으로 인해 전송 효율이 감소할 수도 있다.\n\n미국의 통신사업자 AT&T는 Mesh Topology를 활용하는데 이는 중앙에 모든 Traffic이 집중되지 않기 때문에 가용성이 높고, 국제적인 Traffic이 많고, 이로 인한 traffic이 많기에 토지가 큰 미국의 특성을 이용해 다른 지역에서 사용하지 않는 장비를 우회해서 traffic을 처리할 수 있다는 장점이 있다. 하지만, 유지 관리 과정이 다소 난해하고 이로 인한 비용이 Star Topology보다 크다고 할 수 있다.\n\n### 이동통신\n\n부가적으로 대게의 통신 사업자는 국내 지역에 기지국(Base Station, 대게 전봇대에 설치된 경우가 많다.)을 통해 이동 통신 종량제 네트워크 서비스를 제공한다. 이 역시 BackBorn Network와 연결되어 각종 서비스를 제공한다.\n\n### 이중화\n\nBackBorn Network의 가장 중요한 특징 중 하나가 고가용성을 제공해야 한다는 것이다. 즉, 끊기지 않는 Network를 지향한다는 것이다. 이를 위해서 망 자체를 이중화하고, BackBorn과 연결되는 Router에서의 Link 사용률을 40%로 제한함으로써 일부 장애시에도 문제가 발생하지 않도록 하는 것이다. 또한 Star Topology의 경우 Core Router로 향하는 Link를 삼중화하여 특정 Link에 에러가 발생하여도 최대한 통신이 가능하게 하고자 노력하고 있다.\n\n## Internet\n\n## Datacenter Network\n","slug":"types-of-network","date":"2022-05-27 09:59","title":"Network의 종류","category":"Network","tags":["BackbornNetwork","Internet","DatacenterNetwork","EdgecomputingNetwork","AccessNetwork"],"thumbnailSrc":"https://euidong.github.io/images/base-station.jpg"}],"params":{"subject":"EdgecomputingNetwork"}},"__N_SSG":true}