{"pageProps":{"posts":[{"content":"<!-- thumbnail 바꾸기 -->\n\n## Intro\n\nCNSM 2023 학회가 2023.10.30 - 11.2 까지 캐나다에서 진행되었다. 이번에 좋은 기회를 얻게 되어 학회에 참석할 수 있었고 이는 나의 2023.10.29 ~ 11.4일까지에 걸친 이야기이다.\n\n## Episodes\n\n### 2023.10.29 (일)\n\n출국부터 시작해서 굉장히 다사다난했다. 처음 장거리 비행이기도 했고, 첫날 발표를 해야했기 때문에 굉장히 긴장을 했었다. 뿐만 아니라 개인적으로 힘든 일도 있었기 때문에 29일은 정말 힘들었던 기억이 난다. 비행기에서는 Her이라는 영화를 챙겨보고 굉장히 복잡한 감상에 젖어서 계속 발표 연습을 했던 거 같다. 캐나다 토론토에 도착하고 학회장 근처에 있는 숙소로 이동하기 위해서 3시간 정도 셔틀 버스를 타고 이동해서 최종 시간을 보니 새벽 1시 정도였었다. 굉장히 피곤했지만, 시차적응에 실패하고 걱정, 근심도 많아서 새벽 5시쯤은 되어서 눈을 감았던 거 같다.\n\n### 2023.10.30 (월)\n\n![first-day](/images/first-day.png)\n\n학회 첫날에는 7시에 인나서 주변 구경을 좀 할 생각이였는데 5분 거리 학회장을 찾는데 1시간은 걸린 거 같다. 같은 이름의 호텔이 2개 였는데 다른 곳에 들어가서 학회장소를 찾았다. ㅠㅠ 암튼 위치를 찾고 멀리서 나이아가라 폭포를 구경하고, 학회장에 앉아서 9시부터 시작하는 session을 기다렸다. 첫날은 2column 7page 정도의 paper에 관한 mini conference와 workshop 내용을 벌표하는 두 개의 session이 동시에 진행되었고, 오전 session 시간에는 workshop, 오후 session에는 mini conference 쪽에서 내용을 들었다. 전체적으로 workshop의 경우에는 도전적인 내용이 많았다. LLM 기반으로 intent network를 구현한 내용이라던지 (결론은 종래연구들과 다르지 않게 결국은 classification에 가까웠지만,) anomaly detection을 수행할 때, 각 feature간의 correlation을 활용하여 SOTA 이상의 결과를 받았다는 내용의 발표가 재밌게 다가왔다. 각 각 논문 제목은 다음과 같았다. (후에 시간이 된다면 한번 찾아보면 재밌을지도..ㅎ)\n\n- **LLM-based policy generation for intent-based management of applications**  \n  Kristina Dzeparoska and Jieyu Lin (University of Toronto, Canada); Ali Tizghadam (TELUS & University of Toronto, Canada); Alberto Leon-Garcia (University of Toronto, Canada)\n- **MIMC: Anomaly Detection in Network Data via Multiple Instances of Micro-Cluster Detection**  \n  Rafael N Copstein (Dalhousie University, Canada); Bradley Niblett and Andrew Johnston (2Keys Corporation An Interac Company, Canada); Jeff Schwartzentruber, M. I. Heywood and Nur Zincir-Heywood (Dalhousie University, Canada)\n\nmini conference에서는 전체적으로 Deep Learning을 이용한 Something이 주류가 되었다. (traffic classification, performance prediction, etc.) 작년 CNSM2022에 참석했던 연구실 선배말로는 작년까지만 해도 AI에 대한 논문의 양은 엄청 많지는 않았던 거 같은데 이번에는 그 양이 꽤나 많아서 관련 논문만 50% 이상으로 느껴졌다. 나의 발표는 마지막 session에서 끝에서 두 번째였는데 사실 해당 발표는 연구실 선배의 논문을 대신해서 발표하는 것이였다. 준비는 많이 헀지만 막상 앞에서니 준비했던 내용을 까먹고 넘어간 것도 있어서 아쉽긴했다. 발표보다는 질의응답을 굉장히 걱정했는데 한국인임을 고려했는지 발표가 다소 어눌했는지 다들 굉장히 천천히 말해줘서 알아듣는데는 문제가 없었다. 다만 2저자의 한계상 알 수 없는 실험 디테일에 대한 부분에 대한 자세한 설명을 잘 하지 못했던 것은 아쉬웠다. 이렇게 발표는 끝났고, 월요일은 별도의 저녁 행사가 없기 때문에 숙소가서 짐을 풀고, 밥을 먹으려고 했는데 피곤해서 그냥 뻗어서 자버렸다. 눈을 뜨니 11시가 넘어서 씻고 다시 잤다. ㅎㅎ\n\n### 2023.10.31 (화)\n\n![coffee-time](/images/coffee-time.png)\n\n어제 저녁도 안먹고 잤기 때문에, 굉장히 배고픈 상태로 깨어났다. 놀랍게도 오늘은 내가 작성한 논문 [SDN Lullaby](/posts/sdn-lullaby)도 Poster로 Accept 되어 발표를 해야했기에 8시에 맞춰 도착해서 Poster 준비하고 커피 한잔 내려서 준비를 계속했다. 오늘은 Technical Session에서 2column 9페이지 분량 정도의 논문이 발표되었고, 전체적인 내용은 wireless network와 AI 기반 네트워크 관리가 주류였다. 그리고 Session 중간마다 Coffee break 때에는 Poster 에 대한 발표가 이어졌다. 처음에 서서 기다릴 때는 꽤나 긴장했는데, 사람들이 관심을 가져주니 나름 또 재밌게 이야기하면서 긴장이 꽤나 풀렸던 거 같았다. 친절하게 처음부터 끝까지 무슨 내용인지 물어봐준 학생과 교수님들이 있어서 다행이였다. 그러다보니 금방 시간이 흘러서 정신없이 30분이 지나간 거 같다. 전체적으로 SDN이라는 이름에 질문이 많았는데, 아무래도 이름을 잘못 지은 거는 맞는 거 같다. 사실 VNF Scheduling이 근본이기 때문에 SDN이라는 관련이 없으니까.. Sakamoto라는 Softbank에서 일하고 계신 일본인 분도 강화학습을 진행하고 있어서 관심이 생기셨는지 명함도 주시고, 강화학습 관련해서 그리고 잡다한 이야기를 꽤나 나누었다. 점심 식사 때는 어제 발표 때 public dataset에 대한 실험이 부족했던 이유를 꼬집었던 교수님이 다가와 자기도 anomaly detection 관련 연구를 하고 있다보니 관심이 있어서 그랬다면서 먼저 다가오셔서 anomaly detection 실험에 대해서, 각 모듈들에 대해서 물어보셨다. 오후 session에도 발표 중간 coffee break가 있었고, poster session이 다시 열렸기 때문에 이번에는 다른 사람들의 poster를 구경했다. 처음에는 말걸기가 좀 두려웠는데 오전이 지나면서 좀 자연스럽게 궁금한 걸 물어봤던 거 같다. 그 후 Welcome reception 시간이 찾아왔고, 여러가지 주워먹다가 와인 한잔 홀짝이면서 사람들 얘기하는 걸 듣다가 나와서 나이아가라 폭포를 산책했다. 개인적인 삶이나 목표를 생각하면서 걷다보니 금방 시간이 흘렀고, 방으로 돌아와서 그 날은 꽤나 잠을 잘 잤던 거 같다.\n\n### 2023.11.01 (수)\n\n![third-day-banquet](/images/third-day-banquet.jpg)\n\n수요일부터는 지도 교수님이랑 같이 시간을 꽤나 같이 보냈다. 수요일부터는 발표가 없었기 때문에 여러가지 발표를 들을 수 있었다. 그 중에서 가장 기억에 남는 내용은 Kubernetes에서 container 분배 시에 CPU, Memory 사용량만 고려하는데 여기서 Application의 성능을 고려하지 못함을 꼬집고, container간 communication에서 발생하는 latency를 단축시킬 수 있는 배치 방법을 제안한 연구가 꽤나 재밌게 다가왔다. 내가 진행하는 연구와 비슷하지만, kubernetes를 통해서, 이를 시도했다는 건 꽤나 재밌는 시도로 다가왔다. 혹시 논문 결과가 나오면 아래 논문을 찾아볼 수 있을 것이다.\n\n- **Performance Impact of Queue Sorting in Container-based Application Scheduling**  \n  José Santos (Ghent University - Imec, Belgium); Miel Verkerken, Laurens D'hooge and Tim Wauters (Ghent University - imec, Belgium); Bruno Volckaert (Ghent University-Imec, Belgium); Filip De Turck (Ghent University - imec, Belgium)\n\n수요일 Session이 끝나고는 banquet이 있어서 참석했다. 나이아가라 폴 근처에 위치한 winery에 가게 되었다. 꽤나 근사한 곳이였던 것으로 기억한다. 교수님 친구 분 중에 자녀분도 참석했는데 k-drama에 빠져있다고 해서 이동 중에 이거 관련해서 얘기를 나누었다. 가장 좋아하는 연애인을 물어보니 차은우라고 한 걸 보면, 역시 외국사람들도 보는 눈은 똑같은 거 같다. 근데 나랑은 드라마 취향이 꽤나 안맞긴했다. 확실히 로맨스가 유명한 거 같다. winery 도착해서 Timo라는 박사과정 학생을 만나서 얘기를 나누는데 k-drama 사건도 있고해서, free time에 뭐하냐고 물어보니 소방관 활동을 한다고 해서, 참 놀랐던 기억이 난다. 관련 에피소드도 좀 듣고보니 참 대단하기는 했다. 나도 군대에 가서 삽질 좀 했다고 했는데 박사과정 중에도 하고 있다고 하니 참 본받을만한 친구인 거 같다고 생각했다. 예약에 차질이 있어서 이상한 변두리에서 식사를 하긴 했지만, 음식은 굉장히 맛있었고, 와인도 좋았다. 캐나다에서 유명하다는 아이스 와인은 솔직히 내 취향은 아니였다. 솔직히 너무 달았다. 식사가 끝나고 돌아오니 11시를 넘기고 있었고, 깼다 잤다를 반복헀지만, 금방 잠에 들었다.\n\n### 2023.11.02 (목)\n\n![third-day-naiagarafall](/images/third-day-naiagarafall.png)\n\n학회의 마지막 날이였다. 마지막 날 session들이 굉장히 재밌었다. key note session에 들은 network verification이라는 주제는 특히 해당 학회 기간 중에 가장 남는 키워드로 남을 거 같았다. 사실상 연구 주제로 생각 중이던 network configuration 자동화에 대해서 해당 키워드를 기반으로 연구가 되고 있는지를 파악하지 못했기 때문에 뭔가 혈이 뚫린 느낌이 였고, 이를 기반으로 좀 더 찾아보면 좋은 결과를 얻을 수 있을 거 같다는 느낌을 받아서 굉장히 집중해서 들었다. 요약하자면, network 상태를 verification 하는 것인데, 이를 진단하는 것을 넘어서 추천하는 과정까지도 해당 발표자는 연구를 진행하고 있었다. 한국에 돌아가면 batfish, netcov 관련 논문을 좀 더 찾아보면 도움이 될 것 같다. 또한, network traffic data 기반으로 classification, anomaly detection, prediction 등 여러 가지 작업이 수행되는데 이들이 모두 동일한 dataset을 공유한다는 전제 하에 공유할 수 있는 공통 foundation model을 제안한 key note도 굉장히 재밌었다. NetFound라는 제목으로 foundation 모델을 pretrain해서 여러 task에 적용해서 높은 성능을 보일 수 있음을 증명했기 때문에 나중에 한 번 찾아서 사용해볼만한 가치가 있어보인다. 전체 학회 중으로 봤을 때도 참석자들의 질문, 특히 여러 교수님들의 질문이 가장 많은 두 개의 발표가 위 두 개의 내용이였다. 이를 끝으로 전체 학회는 마무리 되었다. 저녁 식사는 지도 교수님과 TPC들 식사에 함께 참석하였다. 좋은 기회였지만, 꽤나 중압감도 커서 얌전히 맛있는 식사를 하다가 돌아왔다. 다들 확실히 나이가 드셔도 열정이 느껴지는 게 대단했다. 숙소에 돌아왔는데 이날은 관광객인지 건너방에서 소음이 너무 심해서 자다깨다를 계속 반복하다보니 잠을 거의 못잔 거 같다.\n\n### 2023.11.03 (금)\n\n![last-day-cntower](/images/last-day-cntower.png)\n\n학회가 끝나고 하루는 교수님과 토론토 대학 방문을 하였다. 토론토 대학은 정문이 없는 게 확실히 신기했다. 한국에서는 산 속에 존재하는 산신령 같은 게 교수님이고, 대학원생들인데 여기는 평지에 도시 한 가운데에 있으니 확실히 느낌이 달랐다. 일정이 끝나고, 시간이 남아서 근처 켄싱턴 마켓과 온타리오 미술관 관광을 조금 했는데 해외에 있다는 게 확실히 체감이 되었다. 관광하기에 좋은 도시임에는 틀림이 없었다. 하지만, 어제 잠을 거의 못자서 9시에 너무 피곤해서 숙소로 돌아갔다. (미술관에서 잠깐 앉아서 쉬려는데 꾸벅꾸벅 졸았다. ㅎㅎ) 진짜 오랜만에 잠을 푹잤다. 이날 12시간은 넘게 잔 거 같다.\n\n![last-day-gallary](/images/last-day-gallary.png)\n\n## 총평\n\n가장 많이 들었던 말은 Ph.D 과정이냐고 물어본 질문이였다. 항상 master라고 말하면, 당연하다는 듯이 Ph.D 할꺼지? 라고 물어보는게 아주 nice to meet you보다 뻔한 질문이 되었다. 그만큼 master 과정으로 참여하는 것이 쉬운 기회는 아닌데 좋은 기회를 얻어서 갈 수 있었던 거 같다. 또한, 학회에 참석한 모든 학생들이 굉장히 친절했던 것이 기억이 남는다. 항상 먼적 말을 걸어주고, 얘기를 들을 때도 할 때도 신나하는 게 보여서 나도 덩달아 굉장히 즐거웠었다. 학술적으로도 개인적으로도 많이 성장할 수 있는 기회였다.\n","slug":"cnsm2023-memoir","date":"2023-11-04 15:45","title":"CNSM2023 학회 회고록","category":"Memoir","tags":["Conference"],"desc":"CNSM 2023 학회가 2023.10.30 - 11.2 까지 캐나다에서 진행되었다. 이번에 좋은 기회를 얻게 되어 학회에 참석할 수 있었고 이는 나의 2023.10.29 ~ 11.4일까지에 걸친 이야기이다.","thumbnailSrc":"https://euidong.github.io/images/default.jpg"}],"params":{"subject":"Conference"}},"__N_SSG":true}