{"pageProps":{"posts":[{"content":"\n## Reference\n\n- Thumbnail : Photo by [Compare Fibre](https://unsplash.com/@comparefibre?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText) on [Unsplash](https://unsplash.com/s/photos/optical-network?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText)\n\n## Base\n\n광통신은 빛에 데이터를 저장하여 광섬유를 통해서 데이터를 보내는 방식이다. 그렇다면, 굳이 왜 빛으로 변환하는 과정을 거치면서 까지 광통신을 사용하고자 하는지를 알필요가 있다. **이는 간단하게 빠르고, 멀리 전달할 수 있기 때문이다.** 그리고, 전자파를 이용하는 무선통신과 다르게 빛은 4가지의 특징을 가지기 때문이다(반사, 굴절, 간섭, 편광). 광섬유 내부에서는 여러 원인에 의해서 상쇄(손실)가 발생하기 때문에 이를 증폭해줄 방법이 필요하며, 광섬유를 어떻게 구성할지에서부터 처음에 데이터를 어떻게 빛으로 변환할지에 대한 방법과 받은 빛을 다시 데이터로 변환하는 방법이 굉장히 중요하다. 따라서, 이를 위한 기술과 장비들을 먼저 살펴보고 갈 것이다.\n\n![광통신](/images/optical-transfer.jpeg)\n\n### 광섬유\n\n실제로 빛이 이동하는 통로 역할을 수행한다. 주요 구성요소는 보호용 아크릴, cladding, core이다. 빛은 실제로는 core 내부에서만 이동한다. 내부에서 빛은 지그재그로 이동하며 계속해서 cladding과 접하지만 빛의 굴절률을 이용하여 전반사 시키도록 설계를 해두어 core로만 빛이 통하게 된다. 이때, 이러한 빛의 이동 경로를 하나의 mode라고 하고, 이는 처음 빛의 입사각에 따라 달라진다. 이러한 mode를 여러 개 허용한다면, 이는 multi mode fiber(MMF)라고 하고, 하나만 허용한다면 single mode fiber(SMF)라고 한다. 일반적으로는 SMF가 더 고효율 시스템을 활용하기 때문에 전송 효율은 높지만 비용적인 측면에서 MMF도 자주 사용된다.\n\n![광섬유](/images/optical-fiber.jpeg)\n\n#### 광섬유 손실\n\n광섬유는 다음과 같은 이유에 의해서 빛을 손실한다.\n\n1. 결합 손실(Coupling Loss) : 초기에 Lasor 장치와 광섬유의 core 사이에서 발생하는 손실\n2. 흡수 손실 : 광섬유 제작 과정에서 core에 섞인 어쩔 수 없는 불순물에 의한 손실\n3. 산란손실(Scattering Loss) : 광섬유의 core에서의 비균질성에 의해서 굴절률이 순간적으로 변하여 발생하는 손실\n4. 구부러짐에 의한 복사 손실(Bending Loss) : 광섬유의 일부 구부러짐에 의하여 굴절률이 영향을 받아 발생하는 손실\n5. 접속 손실(Joint Loss) : 광섬유간의 결합 과정에서 발생하는 손실\n\n#### 손실 보상(Dispersion Compensation)\n\n광섬유 내에서 손실을 보상하기 위해서 사용되는 대표적인 방법이 4가지가 있다.\n\n1. DCF(Dispersion Compensation Fiber)를 이용한다. 이는 빛의 파장을 더 길게 변화시키는데 이를 이용하여 중간에 증폭을 가하는 것이다. 이를 이용할 때에는 SMF로 광섬유로 채택하고, 먼저 진행한 후에 해당 길이의 19%만큼을 DCF로 통과시켜서 손실된 양만큼을 보충해주고, 다시 SMF로 진행시키는 것이다. 마치 빛을 오목 렌즈(SMF)로 퍼트리면, 다시 볼록 렌즈(DCF)로 모아주는 것과 유사하다.\n2. EDF(Erbium Doped Fiber), PDF(Pr Droped Fiber) 등을 활용한다. 이는 자체적으로 광을 증폭하는 효과를 갖고 있기 때문에 이를 중간에 통과 시켜서 증폭을 수행한다. 이 방식이 더 짧은 길이의 Fiber로 증폭이 가능하다.\n3. 중계기를 활용한다. 중간에서 빛을 다시 전기로 바꾼 후에 이를 다시 광으로 증폭하여 전달하는 방식이다. 이 방식은 편리하지만, 전기가 필요하며, 처리 과정에서의 지연이 크다는 단점이 있다.\n4. 증폭기를 활용한다. 광섬유 내 모든 신호를 증폭 시킨다. Noise도 같이 증폭될 수 있다는 단점이 있지만, 빠르기에 많이 사용된다. 대표적인 증폭의 방법은 다음과 같다.\n   - EDFA : EDF를 이용한 증폭 방법이다. 원리는 전달되는 빛에 약한 광신호를 섞어서 증폭시키는 것이다. 단점은 C, L band만을 커버할 수 있기 때문에 더 넓은 범위에 대해서는 제한적이다.\n   - Raman 증폭 : 빛의 산란효과를 활용하여 특정 주파수 영역의 빛을 증폭시키는 기능을 한다. 더 넓은 범위를 커버할 수 있고, EDFA보다 덜 빈번하게 설치하여도 무방하다.\n\n### Tranceiver\n\n광송수신기를 의미한다. 대게 광송신을 담당하는 TOSA와 광수신을 담당하는 ROSA를 모두 포함하여 만든 장치로 실제 Switch/Router에서 광케이블(광섬유)이 연결되는 interface 역할을 한다. 해당 기술은 소형화와 저전력화가 핵심이고 현재에는 하나의 Switch/Router에 32개 이상 포함할 수 있을 정도로 소형화/저전력화가 진행되었다.\n\n#### Tranceiver 내부의 변조 기술\n\n> **광변조기술**\n\n기본적으로 데이터를 빛으로 바꾸고자 할 때에는 기존 데이터의 주파수를 그대로 이용(BaseBand)하기 보다는 고주파 대역과 결합하여 해당 고주파 대역(BroadBand)으로 변환하여 보낸다. 이를 수행하면 장거리 통신에 유리할 뿐만 아니라 안테나의 길이를 단축할 수 있을 뿐만 아니라 Noise를 개선하기에 유리하다는 장점을 갖고 있다. 이를 기반으로 하여 총 3가지 형태의 변조 기술이 존재한다.\n\n- 직접 변조(Direct Modulation) : 데이터의 0과 1에 따라 광원을 키고 끄고를 수행하도록 하는 방식\n- 외부 변조(External Modulation) : 광원은 계속 켜둔 상태에서 데이터의 0과 1에 따라 빛을 막았다가 통과시켰다를 제어하는 방식\n\n> **신호변조기술**\n\ndata를 신호로 변환하는 기술이다. 대표적인 방식은 4가지가 존재한다.\n\n1. ASK(Amplitude Shift Keying) : 디지털 신호에 고주파 신호를 결합하여 변환 신호를 만드는 방법으로 두 개의 transiter로도 만들 수 잇을 정도로 매우 간단하나 잡음에는 취약하다.\n2. FSK(Frequency Shift Keying) : 디지털 신호에 따라 고주파 신호의 주파수를 변환하여 신호를 보내는 기술로 간단하면서도 잡음에 강하지만, 많은 주파수 대역을 필요로 한다.\n3. PSK(Phase Shift Keying) : 디지털 신호에 따라 고주파 신호의 위상을 역전시켜 변환하여 신호를 보내는 기술로 간단하고 잡음에 강하지만 수신측에 부가적인 위상 추적 장비가 필요하다.\n4. QPSK(Quadrature PSK) : 위상을 더 세분화하여 4단계로 나누어 신호를 보내는 PSK 방식이다. 기존의 PSK보다 전송 효율이 높아진다.\n5. QAM(Quadrature Amplitude Modulation) : ASK와 PSK를 조합한 방식으로 ASK와 PSK를 별도로 수행하고 이에 의해서 생성된 신호를 합쳐서 전송하는 방식이다. 나타나는 위상의 수에 따라서 4-QAM, 8-QAM, 16-QAM, 32-QAM 등으로 나뉜다. 참고로 4-QAM은 사실상 QPSK와 동일하다.\n\n## 광통신망\n\n광 케이블로 구성된 물리 네트워크이다. 크게 4가지 Network로 구성되어진다. 일반적으로는 각 Network가 Ring Topology로 구성된다. 이는 장애에 대비하기 위함이다. OTN이라고도 부르며 중간 Router에서의 변환을 최소화하고 광통신으로 직접적으로 연결하는 하위 네트워크를 구성하는 것이다.\n\n초기에는 SONET/SDH라는 형태를 취하였다. 이는 Synchronous Optical Network / Synchronous Digital Hierarchy의 약자로 거의 비슷한 두 기술을 붙여 부르는 말이다. 사실상 표준을 발행한 기관이 미국이나 국제기관이냐의 차이이다(그래서 세부 용어들은 내부적으로 다르다). TDM으로 다중화 전송을 수행하였다. 이후에는 통계적 다중화라는 TDM의 고정 시간분할을 유동적으로 바꾼 방식이 등장하지만 여기서는 사용되어지 않았다. 원래는 음성 통신에 초점을 맞추었기 때문에 장애 시 사람이 인식하지 못하는 ~50ms 이내에 자동 절체를 수행하는 작업도 최초 도입되었다. 이로인해 음성 통신에서는 우수한 성능을 보였지만 인터넷 트래픽에서는 위에서 말한 통계적 다중화를 지원하지 않아 대역폭 낭비가 심했다. 이에 따라 아래와 같은 형태의 Network로 크게 변화하게 되었다.\n\n1. ROADM : Reconfigurable Optical Add-Drop Multiplexer의 약자로 특정 파장을 Drop하거나 Add하는 장치인 OADM을 발전시킨 장치이다. 원래는 설정을 변경하는 것이 숙력된 기술자들에 의해 하드웨어적으로 가능했는데 이를 원격으로 제어하는 기술을 적용한 것이 ROADM이다.\n2. MSPP : Multi Service Provisioning Platform의 약자로 SONET/SDH와 ATM, Ethernet을 동시에 지원하는 Module로 여러 Platform의 Interface로 기능한다. \n3. PON : Passive Optical Network 의 약자로 하나의 광통신 지원장치(OLT, Optical Line Terminator)를 통해서 모든 빛을 하나의 Fiber로 합하여 여러 장치들에게 광통신을 지원하는 형태의 Network로 대게 광통신의 End 지점에서 많이 사용되는 Network이다.\n   - TDM-PON : Time Division Mulitplexing의 약저로 수신 시에 OLT를 이용하여 광케이블로 온 빛을 직렬화하고, Splitter를 통해서 네트워크에 Broadcasting하는 방식이다. 송신 시에는 시분할을 통해서 각 장비에서 오는 광 데이터를 전송한다.\n   - CWDM-PON : Coarse Wavelength Division Multiplexing 의 약자로 수신 시에 채널을 최대 18개까지로 나누어 각 채널을 통해서 통신을 수행하도록 하는 방식이다. 이때, RN이라는 장치가 Prizm처럼 빛을 분산시키는 역할을 한다.\n   - DWDM-PON : 각 광가입자마다 별도의 고유 파장을 부여하는 방식이다. 방식은 CWDM과 매우 유사하다.\n   - NG-PON2 : TDM과 WDM을 결합하여 하는 방식이다. ","slug":"optical-transport-network","date":"2022-05-28 19:03","title":"광통신망","category":"Network","tags":["OpticalTransportNetwork"],"thumbnailSrc":"https://euidong.github.io/images/optical-network.jpg"}],"params":{"subject":"OpticalTransportNetwork"}},"__N_SSG":true}